fenogy/MedDispenser/Configs/HWP_MIKROMEDIA_PIC32_NEW.h
    // Definitions for POWER ON pin
    #define DisplayPowerConfig()
    #define DisplayPowerOn()
    #define DisplayPowerOff()

    // Definitions for backlight control pin
    #define DisplayBacklightConfig()
    #define DisplayBacklightOn()
    #define DisplayBacklightOff()

    #elif defined (__PIC32MX__)
        /********
	 * PIC32 will use the SET and CLR SFRs for the I/O.
	 * These are atomic settings that are recommended when
	 * modifying SFRs
	 ********/

	 // Definitions for reset pin
        #define DisplayResetConfig()        TRISCCLR = _TRISC_TRISC1_MASK
        #define DisplayResetEnable()        LATCCLR = _LATC_LATC1_MASK
        #define DisplayResetDisable()       LATCSET = _LATC_LATC1_MASK

        // Definitions for RS pin
        #define DisplayCmdDataConfig()      TRISBCLR = _TRISB_TRISB15_MASK
        #define DisplaySetCommand()         LATBCLR = _LATB_LATB15_MASK
        #define DisplaySetData()            LATBSET = _LATB_LATB15_MASK

        // Definitions for CS pin
        #define DisplayConfig()             TRISFCLR = _TRISF_TRISF12_MASK
        #define DisplayEnable()             LATFCLR = _LATF_LATF12_MASK
        #define DisplayDisable()            LATFSET = _LATF_LATF12_MASK

        // Definitions for backlight control pin
        #define DisplayBacklightConfig()    (TRISAbits.TRISA9 = 0)
        #define DisplayBacklightOn()        (LATAbits.LATA9 = BACKLIGHT_ENABLE_LEVEL)
        #define DisplayBacklightOff()       (LATAbits.LATA9 = BACKLIGHT_DISABLE_LEVEL)

	// Definitions for FLASH CS pin
	#define DisplayFlashConfig()
	#define DisplayFlashEnable()
	#define DisplayFlashDisable()

	// Definitions for POWER ON pin
	#define DisplayPowerConfig()
	#define DisplayPowerOn()
	#define DisplayPowerOff()

	#endif
// end of #elif defined (MIKRO_BOARD)

#endif

/*********************************************************************
* HARDWARE PROFILE FOR THE RESISTIVE TOUCHSCREEN
*********************************************************************/
/*
	These are the hardware settings for the 4-wire resistive
	touch screen. There are two analog inputs and two digital I/Os
	needed.

	This portion is divided into 3 components
	1. IO and ADC channels settings - sets up the IO pins used and the
	   ADC channel selected to evaluate the screen touch.
	2. Touch Screen X and Y orientation settings - sets up the
	   x and y directions. This is dependent on how the resistive
	   touch signals (X-, Y-, X+, and Y+) are wired up to the
	   IOs and ADC signals with respect to the orientation of the
	   screen. Based on these factors, we can control the calculation
	   of the touch by swapping x and/or y and flipping the x and/or y
	   directions.
	3. Touch Screen Non-Volatile Memory Storage Macros - this defines
	   the non-volatile memory read, write and sector erase functions
	   to be used when reading or storing calibration values.

	The resistive touch screen driver assumes the following:
	1. X+ and Y+ are mapped to the A/D inputs
	2. X- and Y- are mapped to the pure digital I/Os
*/

#if defined (USE_TOUCHSCREEN_RESISTIVE)

	/*********************************************************************
	* Resistive Touch Screen A/D and I/O Specific Macros
	*********************************************************************/
	// ADC Input Channel Selector
	#if defined(__dsPIC33F__) || defined(__PIC24H__) || defined(__dsPIC33E__) || defined(__PIC24E__)
		#define TOUCH_ADC_INPUT_SEL   AD1CHS0
    #else // all other supported devices
		#define TOUCH_ADC_INPUT_SEL   AD1CHS
    #endif

	// ADC Sample Start
	#define TOUCH_ADC_START   AD1CON1bits.SAMP

	// ADC Status
	#define TOUCH_ADC_DONE   AD1CON1bits.DONE

	// Hardware Platform dependend macros
	/* ----------------------------------------- */
	#if defined (PIC24FJ256DA210_DEV_BOARD)
	/* ----------------------------------------- */
		// ADC channel constants
		// Potentiometer and Temperature sensor
		/* PIC24FJ256DA210 Development Board does
		 * not have a temperature sensor
		 */
		#define ADC_POT			5
		#define ADC_XPOS		16
		#define ADC_YPOS		18

		// ADC Port Control Bits
		#define ADC_POT_PCFG	ANSBbits.ANSB5
		#define ADPCFG_XPOS		ANSCbits.ANSC4
		#define ADPCFG_YPOS		ANSGbits.ANSG7
        #define RESISTIVETOUCH_ANALOG  1
        #define RESISTIVETOUCH_DIGITAL 0

		// X port definitions
        #define ResistiveTouchScreen_XPlus_Drive_High()         LATCbits.LATC4   = 1
        #define ResistiveTouchScreen_XPlus_Drive_Low()          LATCbits.LATC4   = 0
        #define ResistiveTouchScreen_XPlus_Config_As_Input()    TRISCbits.TRISC4 = 1
        #define ResistiveTouchScreen_XPlus_Config_As_Output()   TRISCbits.TRISC4 = 0

        #define ResistiveTouchScreen_XMinus_Drive_High()        LATAbits.LATA2   = 1
        #define ResistiveTouchScreen_XMinus_Drive_Low()         LATAbits.LATA2   = 0
        #define ResistiveTouchScreen_XMinus_Config_As_Input()   TRISAbits.TRISA2 = 1
        #define ResistiveTouchScreen_XMinus_Config_As_Output()  TRISAbits.TRISA2 = 0


		// Y port definitions
        #define ResistiveTouchScreen_YPlus_Drive_High()         LATGbits.LATG7   = 1
        #define ResistiveTouchScreen_YPlus_Drive_Low()          LATGbits.LATG7   = 0
        #define ResistiveTouchScreen_YPlus_Config_As_Input()    TRISGbits.TRISG7 = 1
        #define ResistiveTouchScreen_YPlus_Config_As_Output()   TRISGbits.TRISG7 = 0

        #define ResistiveTouchScreen_YMinus_Drive_High()        LATAbits.LATA1   = 1
        #define ResistiveTouchScreen_YMinus_Drive_Low()         LATAbits.LATA1   = 0
        #define ResistiveTouchScreen_YMinus_Config_As_Input()   TRISAbits.TRISA1 = 1
        #define ResistiveTouchScreen_YMinus_Config_As_Output()  TRISAbits.TRISA1 = 0


    // end of #if defined (PIC24FJ256DA210_DEV_BOARD)...

	/* ----------------------------------------- */
	#elif defined (MEB_BOARD)
	/* ----------------------------------------- */

		// ADC channel constants
		// Potentiometer and Temperature sensor
		/* The Multi-Media Expansion Board does not have a
		 * analog pot or temperature sensor (see BMA150 for temperature
		 * sensor data
		 */
		#if defined(__dsPIC33E__) || defined(__PIC24E__)

			#define ADC_XPOS    11
			#define ADC_YPOS    14

			// X port definitions
            #define ResistiveTouchScreen_XPlus_Drive_High()         LATBbits.LATB11   = 1
            #define ResistiveTouchScreen_XPlus_Drive_Low()          LATBbits.LATB11   = 0
            #define ResistiveTouchScreen_XPlus_Config_As_Input()    TRISBbits.TRISB11 = 1
            #define ResistiveTouchScreen_XPlus_Config_As_Output()   TRISBbits.TRISB11 = 0

