fenogy/MedDispenser/Configs/HWP_MIKROMEDIA_PIC32_NEW.h
            #define ResistiveTouchScreen_XMinus_Drive_High()        LATBbits.LATB13   = 1
            #define ResistiveTouchScreen_XMinus_Drive_Low()         LATBbits.LATB13   = 0
            #define ResistiveTouchScreen_XMinus_Config_As_Input()   {ANSELBbits.ANSB13 = ANSEL_ANALOG; TRISBbits.TRISB13 = 1;}
            #define ResistiveTouchScreen_XMinus_Config_As_Output()  {ANSELBbits.ANSB13 = ANSEL_ANALOG; TRISBbits.TRISB13 = 0;}

			// Y port definitions
            #define ResistiveTouchScreen_YPlus_Drive_High()         LATBbits.LATB14   = 1
            #define ResistiveTouchScreen_YPlus_Drive_Low()          LATBbits.LATB14   = 0
            #define ResistiveTouchScreen_YPlus_Config_As_Input()    TRISBbits.TRISB14 = 1
            #define ResistiveTouchScreen_YPlus_Config_As_Output()   TRISBbits.TRISB14 = 0

            #define ResistiveTouchScreen_YMinus_Drive_High()        LATBbits.LATB12   = 1
            #define ResistiveTouchScreen_YMinus_Drive_Low()         LATBbits.LATB12   = 0
            #define ResistiveTouchScreen_YMinus_Config_As_Input()   {ANSELBbits.ANSB12 = ANSEL_ANALOG; TRISBbits.TRISB12 = 1;}
            #define ResistiveTouchScreen_YMinus_Config_As_Output()  {ANSELBbits.ANSB12 = ANSEL_ANALOG; TRISBbits.TRISB12 = 0;}

		#else

			#define ADC_XPOS    ADC_CH0_POS_SAMPLEA_AN11
			#define ADC_YPOS    ADC_CH0_POS_SAMPLEA_AN14

			// ADC Port Control Bits
			#define ADPCFG_XPOS AD1PCFGbits.PCFG11
			#define ADPCFG_YPOS AD1PCFGbits.PCFG14
	        #define RESISTIVETOUCH_ANALOG  0
            #define RESISTIVETOUCH_DIGITAL 1

			// X port definitions
            #define ResistiveTouchScreen_XPlus_Drive_High()         LATBbits.LATB11   = 1
            #define ResistiveTouchScreen_XPlus_Drive_Low()          LATBbits.LATB11   = 0
            #define ResistiveTouchScreen_XPlus_Config_As_Input()    TRISBbits.TRISB11 = 1
            #define ResistiveTouchScreen_XPlus_Config_As_Output()   TRISBbits.TRISB11 = 0

            #define ResistiveTouchScreen_XMinus_Drive_High()        LATBbits.LATB13   = 1
            #define ResistiveTouchScreen_XMinus_Drive_Low()         LATBbits.LATB13   = 0
            #define ResistiveTouchScreen_XMinus_Config_As_Input()   {AD1PCFGbits.PCFG13 = 1; TRISBbits.TRISB13 = 1;}
            #define ResistiveTouchScreen_XMinus_Config_As_Output()  {AD1PCFGbits.PCFG13 = 1; TRISBbits.TRISB13 = 0;}

			// Y port definitions
            #define ResistiveTouchScreen_YPlus_Drive_High()         LATBbits.LATB14   = 1
            #define ResistiveTouchScreen_YPlus_Drive_Low()          LATBbits.LATB14   = 0
            #define ResistiveTouchScreen_YPlus_Config_As_Input()    TRISBbits.TRISB14 = 1
            #define ResistiveTouchScreen_YPlus_Config_As_Output()   TRISBbits.TRISB14 = 0

            #define ResistiveTouchScreen_YMinus_Drive_High()        LATBbits.LATB12   = 1
            #define ResistiveTouchScreen_YMinus_Drive_Low()         LATBbits.LATB12   = 0
            #define ResistiveTouchScreen_YMinus_Config_As_Input()   {AD1PCFGbits.PCFG12 = 1;  TRISBbits.TRISB12 = 1;}
            #define ResistiveTouchScreen_YMinus_Config_As_Output()  {AD1PCFGbits.PCFG12 = 1;  TRISBbits.TRISB12 = 0;}

		#endif // defined(__dsPIC33E__) || defined(__PIC24E__)

    // end of #elif defined (MEB_BOARD)...

	/* ----------------------------------------- */
	#elif defined (GFX_PICTAIL_LCC)
	/* ----------------------------------------- */

		// ADC channel constants
		// Potentiometer and Temperature sensor
		/* The GFX PICtail LCC Board does not have a
		 * analog pot or temperature sensor (see BMA150 for temperature
		 * sensor data
		 */
		#define ADC_XPOS    ADC_CH0_POS_SAMPLEA_AN0
		#define ADC_YPOS    ADC_CH0_POS_SAMPLEA_AN1

		// ADC Port Control Bits
        #define ADPCFG_XPOS AD1PCFGbits.PCFG0
        #define ADPCFG_YPOS AD1PCFGbits.PCFG1
        #define RESISTIVETOUCH_ANALOG  0
        #define RESISTIVETOUCH_DIGITAL 1

		// X port definitions
        #define ResistiveTouchScreen_XPlus_Drive_High()             LATBbits.LATB0   = 1
        #define ResistiveTouchScreen_XPlus_Drive_Low()              LATBbits.LATB0   = 0
        #define ResistiveTouchScreen_XPlus_Config_As_Input()        TRISBbits.TRISB0 = 1
        #define ResistiveTouchScreen_XPlus_Config_As_Output()       TRISBbits.TRISB0 = 0

        #if defined(_USB) && !defined (PIC32_SK)
           #define ResistiveTouchScreen_XMinus_Drive_High()         LATGbits.LATG15   = 1
           #define ResistiveTouchScreen_XMinus_Drive_Low()          LATGbits.LATG15   = 0
           #define ResistiveTouchScreen_XMinus_Config_As_Input()    TRISGbits.TRISG15 = 1
           #define ResistiveTouchScreen_XMinus_Config_As_Output()   TRISGbits.TRISG15 = 0
        #else
           #define ResistiveTouchScreen_XMinus_Drive_High()         LATDbits.LATD9    = 1
           #define ResistiveTouchScreen_XMinus_Drive_Low()          LATDbits.LATD9    = 0
           #define ResistiveTouchScreen_XMinus_Config_As_Input()    TRISDbits.TRISD9  = 1
           #define ResistiveTouchScreen_XMinus_Config_As_Output()   TRISDbits.TRISD9  = 0
        #endif

		// Y port definitions
        #define ResistiveTouchScreen_YPlus_Drive_High()             LATBbits.LATB1   = 1
        #define ResistiveTouchScreen_YPlus_Drive_Low()              LATBbits.LATB1   = 0
        #define ResistiveTouchScreen_YPlus_Config_As_Input()        TRISBbits.TRISB1 = 1
        #define ResistiveTouchScreen_YPlus_Config_As_Output()       TRISBbits.TRISB1 = 0

        #define ResistiveTouchScreen_YMinus_Drive_High()            LATBbits.LATB9   = 1
        #define ResistiveTouchScreen_YMinus_Drive_Low()             LATBbits.LATB9   = 0
        #define ResistiveTouchScreen_YMinus_Config_As_Input()       TRISBbits.TRISB9 = 1
        #define ResistiveTouchScreen_YMinus_Config_As_Output()      TRISBbits.TRISB9 = 0

    // end of #elif defined (GFX_PICTAIL_LCC)...

	/* ----------------------------------------- */
	#elif defined (GFX_PICTAIL_V3) || defined (GFX_PICTAIL_V3E)  // && defined (EXPLORER_16) || PIC32 Starter Kits
	/* ----------------------------------------- */
	// NOTE: GFX_PICTAIL_V3 can be paired with Explorer 16 or with PIC32 Starter Kits

		#if defined(__dsPIC33FJ128GP804__) || defined(__PIC24HJ128GP504__)
			// ADC channel constants
			// Potentiometer and Temperature sensor
			#define ADC_TEMP        4
			#define ADC_POT         0
			#define ADC_XPOS		5
			#define ADC_YPOS		4

			// ADC Port Control Bits
			#define ADC_POT_TRIS    TRISAbits.TRISA0
			#define ADC_POT_PCFG    AD1PCFGLbits.PCFG0
			#define ADPCFG_XPOS		AD1PCFGLbits.PCFG5
			#define ADPCFG_YPOS		AD1PCFGLbits.PCFG4
            #define RESISTIVETOUCH_ANALOG  0
            #define RESISTIVETOUCH_DIGITAL 1

			// X port definitions
            #define ResistiveTouchScreen_XPlus_Drive_High()         LATBbits.LATB3   = 1
            #define ResistiveTouchScreen_XPlus_Drive_Low()          LATBbits.LATB3   = 0
            #define ResistiveTouchScreen_XPlus_Config_As_Input()    TRISBbits.TRISB3 = 1
            #define ResistiveTouchScreen_XPlus_Config_As_Output()   TRISBbits.TRISB3 = 0

            #define ResistiveTouchScreen_XMinus_Drive_High()        LATCbits.LATC9   = 1
            #define ResistiveTouchScreen_XMinus_Drive_Low()         LATCbits.LATC9   = 0
            #define ResistiveTouchScreen_XMinus_Config_As_Input()   TRISCbits.TRISC9 = 1
            #define ResistiveTouchScreen_XMinus_Config_As_Output()  TRISCbits.TRISC9 = 0

			// Y port definitions
            #define ResistiveTouchScreen_YPlus_Drive_High()         LATBbits.LATB2   = 1
            #define ResistiveTouchScreen_YPlus_Drive_Low()          LATBbits.LATB2   = 0
            #define ResistiveTouchScreen_YPlus_Config_As_Input()    TRISBbits.TRISB2 = 1
            #define ResistiveTouchScreen_YPlus_Config_As_Output()   TRISBbits.TRISB2 = 0

