fenogy/MedDispenser/Configs/HWP_MIKROMEDIA_PIC32_NEW.h
            #define ResistiveTouchScreen_YMinus_Drive_High()        LATCbits.LATC8   = 1
            #define ResistiveTouchScreen_YMinus_Drive_Low()         LATCbits.LATC8   = 0
            #define ResistiveTouchScreen_YMinus_Config_As_Input()   TRISCbits.TRISC8 = 1
            #define ResistiveTouchScreen_YMinus_Config_As_Output()  TRISCbits.TRISC8 = 0

		#elif defined(__PIC32MX__)
            #if defined(__32MX250F128D__)
                // ADC channel constants
                // resistive touch X and Y voltage sensing
                #define ADC_XPOS		ADC_CH0_POS_SAMPLEA_AN7
                #define ADC_YPOS		ADC_CH0_POS_SAMPLEA_AN6

                // ADC Port Control Bits
                #define ADPCFG_XPOS		ANSELCbits.ANSC1
                #define ADPCFG_YPOS		ANSELCbits.ANSC0
                #define RESISTIVETOUCH_ANALOG  1
                #define RESISTIVETOUCH_DIGITAL 0

                // X port definitions
                #define ResistiveTouchScreen_XPlus_Drive_High()         LATCbits.LATC1    = 1
                #define ResistiveTouchScreen_XPlus_Drive_Low()          LATCbits.LATC1    = 0
                #define ResistiveTouchScreen_XPlus_Config_As_Input()    TRISCbits.TRISC1  = 1
                #define ResistiveTouchScreen_XPlus_Config_As_Output()   TRISCbits.TRISC1  = 0

                #define ResistiveTouchScreen_XMinus_Drive_High()        PMADDRSET         = 0x40
                #define ResistiveTouchScreen_XMinus_Drive_Low()         PMADDRCLR         = 0x40
                #define ResistiveTouchScreen_XMinus_Config_As_Input()   {TRISCbits.TRISC9 = 1; PMAENCLR = 0x40;}
                #define ResistiveTouchScreen_XMinus_Config_As_Output()  {TRISCbits.TRISC9 = 0; PMAENSET = 0x40;}

				// Y port definitions
                #define ResistiveTouchScreen_YPlus_Drive_High()         LATCbits.LATC0    = 1
                #define ResistiveTouchScreen_YPlus_Drive_Low()          LATCbits.LATC0    = 0
                #define ResistiveTouchScreen_YPlus_Config_As_Input()    TRISCbits.TRISC0  = 1
                #define ResistiveTouchScreen_YPlus_Config_As_Output()   TRISCbits.TRISC0  = 0

                #define ResistiveTouchScreen_YMinus_Drive_High()        PMADDRSET         = 0x20;
                #define ResistiveTouchScreen_YMinus_Drive_Low()         PMADDRCLR         = 0x20;
                #define ResistiveTouchScreen_YMinus_Config_As_Input()   {PMAENCLR = 0x20; TRISCbits.TRISC8 = 1;}
                #define ResistiveTouchScreen_YMinus_Config_As_Output()  {TRISCbits.TRISC8 = 0; PMAENSET = 0x20;}

            #else

                // ADC channel constants
                // resistive touch X and Y voltage sensing
                #define ADC_XPOS		 ADC_CH0_POS_SAMPLEA_AN11
                #define ADC_YPOS		 ADC_CH0_POS_SAMPLEA_AN10

                // Potentiometer and Temperature sensor
                #define ADC_TEMP		 ADC_CH0_POS_SAMPLEA_AN4
                #if !defined (PIC32_SK)
                    // potentiometer is not present in PIC32 Starter Kits
                    #define ADC_POT	     ADC_CH0_POS_SAMPLEA_AN5
                #endif

                // ADC Port Control Bits
                #if !defined (PIC32_SK)
                    // potentiometer is not present in PIC32 Starter Kits
                    #define ADC_POT_PCFG AD1PCFGbits.PCFG5
                #endif

                #define ADPCFG_XPOS		 AD1PCFGbits.PCFG11
                #define ADPCFG_YPOS		 AD1PCFGbits.PCFG10
                #define RESISTIVETOUCH_ANALOG  0
                #define RESISTIVETOUCH_DIGITAL 1

			    // X port definitions
                #define ResistiveTouchScreen_XPlus_Drive_High()             LATBbits.LATB11   = 1
                #define ResistiveTouchScreen_XPlus_Drive_Low()              LATBbits.LATB11   = 0
                #define ResistiveTouchScreen_XPlus_Config_As_Input()        TRISBbits.TRISB11 = 1
                #define ResistiveTouchScreen_XPlus_Config_As_Output()       TRISBbits.TRISB11 = 0


                #if defined(_USB) && !defined (PIC32_SK)
                    #define ResistiveTouchScreen_XMinus_Drive_High()        LATGbits.LATG15   = 1
                    #define ResistiveTouchScreen_XMinus_Drive_Low()         LATGbits.LATG15   = 0
                    #define ResistiveTouchScreen_XMinus_Config_As_Input()   TRISGbits.TRISG15 = 1
                    #define ResistiveTouchScreen_XMinus_Config_As_Output()  TRISGbits.TRISG15 = 0
                #else  // other supported PIC 32 devices
                    #define ResistiveTouchScreen_XMinus_Drive_High()        LATDbits.LATD9   = 1
                    #define ResistiveTouchScreen_XMinus_Drive_Low()         LATDbits.LATD9   = 0
                    #define ResistiveTouchScreen_XMinus_Config_As_Input()   TRISDbits.TRISD9 = 1
                    #define ResistiveTouchScreen_XMinus_Config_As_Output()  TRISDbits.TRISD9 = 0
                #endif

                // Y port definitions
                #define ResistiveTouchScreen_YPlus_Drive_High()             LATBbits.LATB10   = 1
                #define ResistiveTouchScreen_YPlus_Drive_Low()              LATBbits.LATB10   = 0
                #define ResistiveTouchScreen_YPlus_Config_As_Input()        TRISBbits.TRISB10 = 1
                #define ResistiveTouchScreen_YPlus_Config_As_Output()       TRISBbits.TRISB10 = 0

                #if defined (GFX_PICTAIL_V3E) && defined(PIC32_SK)
                    #define ResistiveTouchScreen_YMinus_Drive_High()        LATBbits.LATB15   = 1
                    #define ResistiveTouchScreen_YMinus_Drive_Low()         LATBbits.LATB15   = 0
                    #define ResistiveTouchScreen_YMinus_Config_As_Input()   TRISBbits.TRISB15 = 1
                    #define ResistiveTouchScreen_YMinus_Config_As_Output()  TRISBbits.TRISB15 = 0
                #else
                    #define ResistiveTouchScreen_YMinus_Drive_High()        LATDbits.LATD8    = 1
                    #define ResistiveTouchScreen_YMinus_Drive_Low()         LATDbits.LATD8    = 0
                    #define ResistiveTouchScreen_YMinus_Config_As_Input()   TRISDbits.TRISD8  = 1
                    #define ResistiveTouchScreen_YMinus_Config_As_Output()  TRISDbits.TRISD8  = 0
                #endif

            #endif

