fenogy/MedDispenser/Configs/HWP_MIKROMEDIA_PIC32_NEW.h
        #define ADDRESS_RESISTIVE_TOUCH_LLX     0
        #define ADDRESS_RESISTIVE_TOUCH_LLY     0
        #define ADDRESS_RESISTIVE_TOUCH_LRX     0
        #define ADDRESS_RESISTIVE_TOUCH_LRY     0

		#define NVMSectorErase					((void *)0)
    	#define NVMWrite 						((void *)0)
    	#define NVMRead 						((void *)0)

    #endif

#endif // defined (USE_TOUCHSCREEN_RESISTIVE)

/*********************************************************************
* HARDWARE PROFILE FOR THE AR1020 TOUCHSCREEN
*********************************************************************/
#if defined (USE_TOUCHSCREEN_AR1020)

	/*********************************************************************
	* Touch Screen X and Y orientation
	*********************************************************************/
	/*********************************************************************
	Description:
		The usage of the resistive touch screen will be affected
		by the way the hardware is mapped to the A/D channels that
		samples the touch. Since resistive touch is basically a
		measurement of X and Y coordinates the following are macros
		that can modify the touch algorithm when sampling the
		touch.
		TOUCHSCREEN_RESISTIVE_FLIP_X - will flip the x direction.
		TOUCHSCREEN_RESISTIVE_FLIP_Y - will flip the y direction.
		TOUCHSCREEN_RESISTIVE_SWAP_XY - will swap the x and y sampling.

		As long as the (X-,Y-) and (X+,Y+) are used consistently,
		and connected properly in hardware, the macros above
		can provide options to the user to align the touch screen
		to the screen orientation.

        Another macro that may affect the way the x and y measurement
        are the following:
        TOUCHSCREEN_RESISTIVE_PRESS_THRESHOLD - determines how light the
            touch on the screen. The smaller the  value the lighter the
            touch. Valid range of values: 0-0x03ff
        TOUCHSCREEN_RESISTIVE_CALIBRATION_SCALE_FACTOR - this is the scale
            factor used to calculate the touch coefficients. The equation
            to calculate the scale factor is:
               (1 << TOUCHSCREEN_RESISTIVE_CALIBRATION_SCALE_FACTOR).
            Valid values: 0 - 15 (most resistive touch screens will work
                                  in the range of 5 - 7)

	*********************************************************************/
	/* ----------------------------------------- */
	#if defined (GFX_PICTAIL_V3)              || \
		  defined (GFX_PICTAIL_V3E)             || \
          defined (GFX_PICTAIL_LCC)             || \
		  defined (PIC24FJ256DA210_DEV_BOARD)   || \
	      defined (MEB_BOARD)
	/* ----------------------------------------- */
	/*********************************************************************
	* Touch Screen Non-Volatile Memory Storage Macros
	*********************************************************************/
	/* ----------------------------------------- */
	#if defined (USE_MCHP25LC256)
	/* ----------------------------------------- */
		// for  GFX_PICTAIL_V1 or GFX_PICTAIL_V2
		// Addresses for calibration and version values in EEPROM on Explorer 16
        #define ADDRESS_RESISTIVE_TOUCH_VERSION (unsigned)0x7FFE

        // define the functions to call for the non-volatile memory
        // check out touch screen module for definitions of the following function pointers
        // used: NVM_READ_FUNC, NVM_WRITE_FUNC & NVM_SECTORERASE_FUNC
		#define NVMSectorErase					((NVM_SECTORERASE_FUNC)0)
    	#define NVMWrite 						((NVM_WRITE_FUNC)&MCHP25LC256WriteWord)
    	#define NVMRead 						((NVM_READ_FUNC)&MCHP25LC256ReadWord)


	/* ----------------------------------------- */
    #elif defined (USE_SST25VF016) || defined (USE_M25P80)
	/* ----------------------------------------- */
		// Addresses for calibration and version values in SPI Flash on Graphics PICtail 3 & PIC24FJ256DA210 Development Board.
		// Or Addresses for calibration and version values in Parallel Flash on PIC24FJ256DA210 Development Board.
        #define ADDRESS_RESISTIVE_TOUCH_VERSION	(unsigned long)0xFFFFFFFE

        // define the functions to call for the non-volatile memory
        // check out touch screen module for definitions of the following function pointers
        // used: NVM_READ_FUNC, NVM_WRITE_FUNC & NVM_SECTORERASE_FUNC
		#define NVMSectorErase					((NVM_SECTORERASE_FUNC)&SST25SectorErase)
    	#define NVMWrite 						((NVM_WRITE_FUNC)&SST25WriteWord)
    	#define NVMRead 						((NVM_READ_FUNC)&SST25ReadWord)

	/* ----------------------------------------- */
	#elif defined (USE_SST39LF400)
	/* ----------------------------------------- */
		// for  PIC24FJ256DA210 Dev Board
		#define ADDRESS_RESISTIVE_TOUCH_VERSION	(unsigned long)0x0003FFFE

        // define the functions to call for the non-volatile memory
        // check out touch screen module for definitions of the following function pointers
        // used: NVM_READ_FUNC, NVM_WRITE_FUNC & NVM_SECTORERASE_FUNC
		#define NVMSectorErase					((NVM_SECTORERASE_FUNC)&SST39LF400SectorErase)
    	#define NVMWrite 						((NVM_WRITE_FUNC)&SST39LF400WriteWord)
    	#define NVMRead 						((NVM_READ_FUNC)&SST39LF400ReadWord)

	/* ----------------------------------------- */
	#else	// when no non-volatile memory is used
	/* ----------------------------------------- */
		#warning "Non-Volatile Memory addresses is not set for touch screen calibration"

		#define ADDRESS_RESISTIVE_TOUCH_VERSION	0
	    #define ADDRESS_RESISTIVE_TOUCH_COEFA   0
	    #define ADDRESS_RESISTIVE_TOUCH_COEFB   0
	    #define ADDRESS_RESISTIVE_TOUCH_COEFC   0
	    #define ADDRESS_RESISTIVE_TOUCH_COEFD   0

		#define NVMSectorErase					((void *)0)
    	#define NVMWrite 						((void *)0)
    	#define NVMRead 						((void *)0)

    #endif
#endif

    // define the SPI channel to be used
    #if defined (GFX_PICTAIL_V3E)
        #define AR1020_SPI_CHANNEL 2
    #elif defined (PIC24FJ256DA210_DEV_BOARD)
        #ifdef PIC24FJ256DA210_DEV_BOARD_ENC624J600
            #define AR1020_SPI_CHANNEL 1
        #else
            #define AR1020_SPI_CHANNEL 2
        #endif
    #endif


