fenogy/MedDispenser/Configs/HWP_MIKROMEDIA_PIC32_NEW.h
    #if defined (MIKRO_BOARD)
		#if defined (__PIC24FJ256GB110__)
            #define SST25_CS_TRIS   TRISCbits.TRISC2
            #define SST25_CS_LAT    LATCbits.LATC2
            #define SST25_SCK_TRIS  TRISGbits.TRISG6
            #define SST25_SDO_TRIS  TRISGbits.TRISG8
            #define SST25_SDI_TRIS  TRISGbits.TRISG7

                #elif defined (__PIC32MX__)
	    	#if (SST25_SPI_CHANNEL == 2)
		    	#define SST25_CS_TRIS       TRISCbits.TRISC2
			    #define SST25_CS_LAT        LATCbits.LATC2
	    		//#define SPI_FLASH_CHANNEL   CPLD_SPI2
		    #elif (SST25_SPI_CHANNEL == 3)
			    #define SST25_CS_TRIS       TRISGbits.TRISG9
			    #define SST25_CS_LAT        LATGbits.LATG9
			    //#define SPI_FLASH_CHANNEL   CPLD_SPI2A
	    	#elif (SST25_SPI_CHANNEL == 4)
	    		#define SST25_CS_TRIS       TRISFbits.TRISF12
	    		#define SST25_CS_LAT        LATFbits.LATF12
	    		//#define SPI_FLASH_CHANNEL   CPLD_SPI3A
	    	#else
				#error "MultiMedia Expansion Board (MEB) needs to use SPI channels 2,3 or 4 (SST25_SPI_CHANNEL == 2, 3 or 4) for for SPI Flash"
	    	#endif
        #endif
    #endif

#endif // #if defined (USE_M25P80)

/*********************************************************************
* HARDWARE PROFILE FOR THE PARALLEL FLASH MEMORY
*********************************************************************/
/*
	These are the hardware settings for parallel flash
	memory on GFX2 and PIC24FJ256DA210 Development Board
*/

#if defined (USE_SST39LF400)
    /*
        Driver controls the parallel flash interface since it is connected to
        EPMP in PIC24FJ256DA210 Development Board
    */
#endif // #if defined (USE_SST39LF400)


/*********************************************************************
* HARDWARE PROFILE FOR THE TIMING CONTROLLER
*********************************************************************/
/*
	Timing Controllers (TCON) are used by some displays.
	The display selected will determine the TCON that will be used
	in the build.
	When using SSD1926, the TCON is connected through the SSD1926
	GPIO and SPI transfers is BitBanged on these GPIO ports.
	Refer to SSD1926 implementation for details.
*/
	/*********************************************************************
	* I/Os for the TCON
	*********************************************************************/

	/* ----------------------------------------- */
	#if defined (PIC24FJ256DA210_DEV_BOARD)
		#if defined (GFX_USE_DISPLAY_PANEL_TFT_G240320LTSW_118W_E) || defined (GFX_USE_DISPLAY_PANEL_35QVW0T)
	/* ----------------------------------------- */

		#define TCON_CS_LAT      LATAbits.LATA0   //_RA0
		#define TCON_CS_TRIS     TRISAbits.TRISA0 //_TRISA0
		#define TCON_CS_DIG()

		#define TCON_SCL_LAT     LATDbits.LATD8   //_RD8
		#define TCON_SCL_TRIS    TRISDbits.TRISD8 //_TRISD8
		#define TCON_SCL_DIG()

		#define TCON_SDO_LAT     LATBbits.LATB1   //_RB1
		#define TCON_SDO_TRIS    TRISBbits.TRISB1 //_TRISB1
		#define TCON_SDO_DIG()   _ANSB1 = ANSEL_DIGITAL;

		#define TCON_DC_LAT      LATBbits.LATB0   //_RB0
		#define TCON_DC_TRIS     TRISBbits.TRISB0 //_TRISB0
		#define TCON_DC_DIG()    _ANSB0 = ANSEL_DIGITAL;

		#endif // #if defined (GFX_USE_DISPLAY_PANEL_TFT_G240320LTSW_118W_E)
	#endif // #if defined (DA210_DEV_BOARD)...

	/* ----------------------------------------- */
	#if defined (GFX_PICTAIL_LCC)
		#if defined (GFX_USE_DISPLAY_PANEL_TFT_G240320LTSW_118W_E)
	/* ----------------------------------------- */

		#define TCON_CS_LAT      LATCbits.LATC2
		#define TCON_CS_TRIS     TRISCbits.TRISC2
		#define TCON_CS_DIG()

	      #if defined(__32MX795F512L__)
		#define TCON_SCL_LAT     LATDbits.LATD10
		#define TCON_SCL_TRIS    TRISDbits.TRISD10
		#define TCON_SCL_DIG()

		#define TCON_SDO_LAT     LATDbits.LATD0
		#define TCON_SDO_TRIS    TRISDbits.TRISD0
		#define TCON_SDO_DIG()   1;
	      #else
		#define TCON_SCL_LAT     LATFbits.LATF6
		#define TCON_SCL_TRIS    TRISFbits.TRISF6
		#define TCON_SCL_DIG()

		#define TCON_SDO_LAT     LATFbits.LATF8
		#define TCON_SDO_TRIS    TRISFbits.TRISF8
		#define TCON_SDO_DIG()   1;
            #endif

		#define TCON_DC_LAT      LATBbits.LATB3
		#define TCON_DC_TRIS     TRISBbits.TRISB3
		#define TCON_DC_DIG()    1;

		#endif // #if defined (GFX_USE_DISPLAY_PANEL_TFT_G240320LTSW_118W_E)
	#endif // #if defined (DA210_DEV_BOARD)...

/*********************************************************************
* IPU OPERATION MACROS.
*********************************************************************/
/* ********************************************************************
* These defines the cache areas when using IPU of the Graphics Module.
* The IPU operation will need two cache areas:
* - for compressed data (GFX_COMPRESSED_DATA_RAM_ADDRESS,
*   GFX_COMPRESSED_BUFFER_SIZE)
* - for decompressed data (GFX_DECOMPRESSED_DATA_RAM_ADDRESS,
*   GFX_DECOMPRESSED_BUFFER_SIZE)
* These two areas are not part of the memory that the Display Driver
* uses for the viewable pixels. These two areas will exclusively be
* used by the IPU operation to perform the decompression.
* The use of the IPU cache areas assumes that the hardware used
* is the PIC24FJ256DA210 Development Board where the EPMP CS1 is hooked
* up to SRAM and EPMP CS2 is hooked up to a parallel flash memory.
* Make sure that the buffer sizes are word aligned since IPU operates
* only on WORD aligned addresses.
* Users can derive the size of the two areas based on the output of the
* "Graphics Resource Converter" tool used to generate the hex or C array
* of the compressed images. Please refer to the "Graphics Resource
* Converter" Help file for details.
* If the compressed image is placed in Parallel Flash, then the
* GFX_COMPRESSED_BUFFER_SIZE is not needed since the IPU module
* can access the compressed data directly.
********************************************************************  */

#if defined (PIC24FJ256DA210_DEV_BOARD)
	#if defined (GFX_EPMP_CS1_BASE_ADDRESS)

		#define GFX_COMPRESSED_BUFFER_SIZE              (13950)
        #define GFX_DECOMPRESSED_BUFFER_SIZE            (19216)
        #define GFX_IPU_TEMP_DATA_TRANSFER_ARRAY_SIZE   (1024)

	#else
        // a check if the buffer start address is mapped outside the PIC24FJ256DA210
        #if (GFX_DISPLAY_BUFFER_START_ADDRESS >= 0x00017700ul)
		    #warning "EPMP CS1 or CS2 Base Addresses are not defined. If you are using IPU make sure that the GFX_COMPRESSED_DATA_RAM_ADDRESS & GFX_DECOMPRESSED_DATA_RAM_ADDRESS are allocated properly in internal memory."
        #endif
    #endif

